app/controllers/movies_controller.rb

  def search
    @similar_movies = Movie.similar_movies(params[:title])
    @movie = Movie.find_by(title: params[:title])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]